#pragma once

class KeystrokeBaseline {
public:
    // «·Õœ «·√œ‰Ï «·„”„ÊÕ ·ﬂ·  ÊﬁÌ 
    const float lower_bounds[15] = {
        0.042036f, 0.042304f, 0.045457f, 0.029858f, 0.048442f, 0.048456f, 0.054983f, 0.035627f, 0.157576f, 0.132522f, 0.218162f, 0.128935f, 0.132436f, 0.125045f, 0.113001f
    };

    // «·Õœ «·√ﬁ’Ï «·„”„ÊÕ ·ﬂ·  ÊﬁÌ 
    const float upper_bounds[15] = {
        0.119651f, 0.134104f, 0.121291f, 0.140611f, 0.133867f, 0.140468f, 0.147202f, 0.114141f, 0.506169f, 0.380523f, 1.290737f, 1.218473f, 0.341177f, 0.374139f, 0.353157f
    };

    // ≈–«  Ã«Ê“ √Ì “— √Ê «‰ ﬁ«· ÕœÊœÂ -> €—Ì» ›Ê—« (0)
    int predict(float *x) {
        for (int i = 0; i < 15; i++) {
            if (x[i] < lower_bounds[i] || x[i] > upper_bounds[i]) {
                return 0; //  „ —’œ ‘–Ê– ›Ì «· ÊﬁÌ 
            }
        }
        return 1; // ﬂ· «·√“—«— Ê«·«‰ ﬁ«·«  ÷„‰  ÊﬁÌ ﬂ «·ÿ»Ì⁄Ì
    }
};
